{
  "backend/main.mo": "Empty backend actor with no functionality.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base/theme variables using OKLCH colors with light/dark mode and global background/foreground styling.",
  "frontend/index.html": "HTML entry point defining root container and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, wraps app with ThemeProvider, SiteLayout, and Toaster.",
  "frontend/src/components/AnimatedPageContainer.tsx": "Wrapper providing fade and slide-up animations when page content changes.",
  "frontend/src/components/ContourBackground.tsx": "Fixed low-opacity contour background layer covering the entire viewport.",
  "frontend/src/components/SiteFooter.tsx": "Responsive footer with branding, quick links, contact info, hours, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Sticky responsive header with desktop and mobile navigation using shadcn/ui components.",
  "frontend/src/components/SiteLayout.tsx": "Shared page layout combining background, header, animated container, and footer.",
  "frontend/src/components/three/CafeControlsOverlay.tsx": "Overlay UI for 3D scene providing help card, reset button, and toggleable instructions.",
  "frontend/src/components/three/CafeRoomScene.tsx": "Three.js scene rendering a cafe room with animated steam, lighting, furniture, and camera controls.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages a backend actor based on Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity authentication and session state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks; currently empty.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, animations, and custom utility classes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying the café story, highlights, and values using styled components.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with input fields, validation, toast feedback, and contact info layout.",
  "frontend/src/pages/ExportDownloadPage.tsx": "Page with UI elements for downloading a static export zip, including package details and a download trigger.",
  "frontend/src/pages/HomePage.tsx": "Home page showing an interactive 3D cafe scene with a hero section and feature highlights.",
  "frontend/src/pages/MenuPage.tsx": "Menu page that renders categorized food and drink items using card-based layout and icons.",
  "frontend/tailwind.config.js": "Tailwind config extending colors, animations, fonts, and container settings for the site's theme.",
  "project_state.json": "Project metadata describing goals, features, requirements, and current site state."
}